nightt5879/MM32_Template/MM32F0140/STARTUP/Include/reg_flexcan.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_flexcan.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_FLEXCAN_H
#define __REG_FLEXCAN_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"




#if defined ( __CC_ARM )
#pragma anon_unions
#endif







////////////////////////////////////////////////////////////////////////////////
/// @brief CAN Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define FLEX_CAN1_BASE                       (APB1PERIPH_BASE + 0xC000)              ///< Base Address: 0x4000C000


///< CAN   Typedef
typedef struct {
    __IO u32 MCR;                                                               ///<  Module Configuration Register, offset: 0x0
    __IO u32 CTRL1;                                                             ///<  Control 1 register, offset: 0x4
    __IO u32 TIMER;                                                             ///<  Free Running Timer, offset: 0x8
    u8 RESERVED_0[4];
    __IO u32 RXMGMASK;                                                          ///<  Rx Mailboxes Global Mask Register, offset: 0x10
    __IO u32 RX14MASK;                                                          ///<  Rx 14 Mask register, offset: 0x14
    __IO u32 RX15MASK;                                                          ///<  Rx 15 Mask register, offset: 0x18
    __IO u32 ECR;                                                               ///<  Error Counter, offset: 0x1C
    __IO u32 ESR1;                                                              ///<  Error and Status 1 register, offset: 0x20
    u8 RESERVED_1[4];
    __IO u32 IMASK1;                                                            ///<  Interrupt Masks 1 register, offset: 0x28
    u8 RESERVED_2[4];
    __IO u32 IFLAG1;                                                            ///<  Interrupt Flags 1 register, offset: 0x30
    __IO u32 CTRL2;                                                             ///<  Control 2 register, offset: 0x34
    __I  u32 ESR2;                                                              ///<  Error and Status 2 register, offset: 0x38
    u8 RESERVED_3[8];
    __I  u32 CRCR;                                                              ///<  CRC Register, offset: 0x44
    __IO u32 RXFGMASK;                                                          ///<  Rx FIFO Global Mask register, offset: 0x48
    __I  u32 RXFIR;                                                             ///<  Rx FIFO Information Register, offset: 0x4C
    __IO u32 CBT;                                                               ///<  CAN Bit Timing Register, offset: 0x50
    u8 RESERVED_4[44];
    struct {                                                                    ///<  offset: 0x80, array step: 0x10 128bit
        __IO u32 CS;                                                            ///<  Message Buffer 0 CS Register..Message Buffer 15 CS Register, array offset: 0x80, array step: 0x10
        __IO u32 ID;                                                            ///<  Message Buffer 0 ID Register..Message Buffer 15 ID Register, array offset: 0x84, array step: 0x10
        __IO u32 WORD0;                                                         ///<  Message Buffer 0 WORD0 Register..Message Buffer 15 WORD0 Register, array offset: 0x88, array step: 0x10
        __IO u32 WORD1;                                                         ///<  Message Buffer 0 WORD1 Register..Message Buffer 15 WORD1 Register, array offset: 0x8C, array step: 0x10
    } MB[16];
    u8 RESERVED_5[1792];
    __IO u32 RXIMR[16];                                                         ///<  Rx Individual Mask Registers, array offset: 0x880, array step: 0x4
} Flex_CAN_TypeDef;


////////////////////////////////////////////////////////////////////////////////
/// @brief CAN type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define FLEX_CAN1                        ((Flex_CAN_TypeDef*) FLEX_CAN1_BASE)




#define IDEAL_SP_LOW    (750U)
#define IDEAL_SP_MID    (800U)
#define IDEAL_SP_HIGH   (875U)
#define IDEAL_SP_FACTOR (1000U)

// FLEXCAN module features

// @brief Message buffer size
#define FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(x) (16)
// @brief Has doze mode support (register bit field MCR[DOZE]).
#define FLEXCAN_HAS_DOZE_MODE_SUPPORT (0)
// @brief Insatnce has doze mode support (register bit field MCR[DOZE]).
#define FLEXCAN_INSTANCE_HAS_DOZE_MODE_SUPPORTn(x) (0)
// @brief Has a glitch filter on the receive pin (register bit field MCR[WAKSRC]).
#define FLEXCAN_HAS_GLITCH_FILTER (1)
// @brief Has extended interrupt mask and flag register (register IMASK2, IFLAG2).
#define FLEXCAN_HAS_EXTENDED_FLAG_REGISTER (0)
// @brief Instance has extended bit timing register (register CBT).
#define FLEXCAN_INSTANCE_HAS_EXTENDED_TIMING_REGISTERn(x) (1)
// @brief Has a receive FIFO DMA feature (register bit field MCR[DMA]).
#define FLEXCAN_HAS_RX_FIFO_DMA (1)
// @brief Instance has a receive FIFO DMA feature (register bit field MCR[DMA]).
#define FLEXCAN_INSTANCE_HAS_RX_FIFO_DMAn(x) (1)
// @brief Has separate message buffer 0 interrupt flag (register bit field IFLAG1[BUF0I]).
#define FLEXCAN_HAS_SEPARATE_BUFFER_0_FLAG (1)
// @brief Has bitfield name BUF31TO0M.
#define FLEXCAN_HAS_BUF31TO0M (1)
// @brief Number of interrupt vectors.
#define FLEXCAN_INTERRUPT_COUNT (6)
// @brief Is affected by errata with ID 5641 (Module does not transmit a message that is enabled to be transmitted at a specific moment during the arbitration process).
#define FLEXCAN_HAS_ERRATA_5641 (0)


