nightt5879/MM32_Template/MM32F0140/STARTUP/Include/reg_flexcan.h
/// @name RXMGMASK - Rx Mailboxes Global Mask Register
/// @{
#define CAN_RXMGMASK_MG_MASK                     (0xFFFFFFFFU)
#define CAN_RXMGMASK_MG_SHIFT                    (0U)
/// MG - Rx Mailboxes Global Mask Bits
/// 0b00000000000000000000000000000000..The corresponding bit in the filter is "don't care."
/// 0b00000000000000000000000000000001..The corresponding bit in the filter is checked.

#define CAN_RXMGMASK_MG(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_RXMGMASK_MG_SHIFT)) & CAN_RXMGMASK_MG_MASK)
/// @}

/// @name RX14MASK - Rx 14 Mask register
/// @{
#define CAN_RX14MASK_RX14M_MASK                  (0xFFFFFFFFU)
#define CAN_RX14MASK_RX14M_SHIFT                 (0U)
/// RX14M - Rx Buffer 14 Mask Bits
/// 0b00000000000000000000000000000000..The corresponding bit in the filter is "don't care."
/// 0b00000000000000000000000000000001..The corresponding bit in the filter is checked.

#define CAN_RX14MASK_RX14M(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_RX14MASK_RX14M_SHIFT)) & CAN_RX14MASK_RX14M_MASK)
/// @}

/// @name RX15MASK - Rx 15 Mask register
/// @{
#define CAN_RX15MASK_RX15M_MASK                  (0xFFFFFFFFU)
#define CAN_RX15MASK_RX15M_SHIFT                 (0U)
/// RX15M - Rx Buffer 15 Mask Bits
/// 0b00000000000000000000000000000000..The corresponding bit in the filter is "don't care."
/// 0b00000000000000000000000000000001..The corresponding bit in the filter is checked.

#define CAN_RX15MASK_RX15M(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_RX15MASK_RX15M_SHIFT)) & CAN_RX15MASK_RX15M_MASK)
/// @}

/// @name ECR - Error Counter
/// @{
#define CAN_ECR_TXERRCNT_MASK                    (0xFFU)
#define CAN_ECR_TXERRCNT_SHIFT                   (0U)
#define CAN_ECR_TXERRCNT(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ECR_TXERRCNT_SHIFT)) & CAN_ECR_TXERRCNT_MASK)
#define CAN_ECR_RXERRCNT_MASK                    (0xFF00U)
#define CAN_ECR_RXERRCNT_SHIFT                   (8U)
#define CAN_ECR_RXERRCNT(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ECR_RXERRCNT_SHIFT)) & CAN_ECR_RXERRCNT_MASK)
/// @}

/// @name ESR1 - Error and Status 1 register
/// @{
#define CAN_ESR1_WAKINT_MASK                     (0x1U)
#define CAN_ESR1_WAKINT_SHIFT                    (0U)
/// WAKINT - Wake-Up Interrupt
/// 0b0..No such occurrence.
/// 0b1..Indicates a recessive to dominant transition was received on the CAN bus.

#define CAN_ESR1_WAKINT(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_WAKINT_SHIFT)) & CAN_ESR1_WAKINT_MASK)
#define CAN_ESR1_ERRINT_MASK                     (0x2U)
#define CAN_ESR1_ERRINT_SHIFT                    (1U)
/// ERRINT - Error Interrupt
/// 0b0..No such occurrence.
/// 0b1..Indicates setting of any Error Bit in the Error and Status Register.

#define CAN_ESR1_ERRINT(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_ERRINT_SHIFT)) & CAN_ESR1_ERRINT_MASK)
#define CAN_ESR1_BOFFINT_MASK                    (0x4U)
#define CAN_ESR1_BOFFINT_SHIFT                   (2U)
/// BOFFINT - Bus Off Interrupt
/// 0b0..No such occurrence.
/// 0b1..FlexCAN module entered Bus Off state.

#define CAN_ESR1_BOFFINT(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_BOFFINT_SHIFT)) & CAN_ESR1_BOFFINT_MASK)
#define CAN_ESR1_RX_MASK                         (0x8U)
#define CAN_ESR1_RX_SHIFT                        (3U)
/// RX - FlexCAN In Reception
/// 0b0..FlexCAN is not receiving a message.
/// 0b1..FlexCAN is receiving a message.

#define CAN_ESR1_RX(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_RX_SHIFT)) & CAN_ESR1_RX_MASK)
#define CAN_ESR1_FLTCONF_MASK                    (0x30U)
#define CAN_ESR1_FLTCONF_SHIFT                   (4U)
/// FLTCONF - Fault Confinement State
/// 0b00..Error Active
/// 0b01..Error Passive
/// 0b1x..Bus Off

#define CAN_ESR1_FLTCONF(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_FLTCONF_SHIFT)) & CAN_ESR1_FLTCONF_MASK)
#define CAN_ESR1_TX_MASK                         (0x40U)
#define CAN_ESR1_TX_SHIFT                        (6U)
/// TX - FlexCAN In Transmission
/// 0b0..FlexCAN is not transmitting a message.
/// 0b1..FlexCAN is transmitting a message.

#define CAN_ESR1_TX(x)                           (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_TX_SHIFT)) & CAN_ESR1_TX_MASK)
#define CAN_ESR1_IDLE_MASK                       (0x80U)
#define CAN_ESR1_IDLE_SHIFT                      (7U)
/// IDLE
/// 0b0..No such occurrence.
/// 0b1..CAN bus is now IDLE.

#define CAN_ESR1_IDLE(x)                         (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_IDLE_SHIFT)) & CAN_ESR1_IDLE_MASK)
#define CAN_ESR1_RXWRN_MASK                      (0x100U)
#define CAN_ESR1_RXWRN_SHIFT                     (8U)
/// RXWRN - Rx Error Warning
/// 0b0..No such occurrence.
/// 0b1..RXERRCNT is greater than or equal to 96.

#define CAN_ESR1_RXWRN(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_RXWRN_SHIFT)) & CAN_ESR1_RXWRN_MASK)
#define CAN_ESR1_TXWRN_MASK                      (0x200U)
#define CAN_ESR1_TXWRN_SHIFT                     (9U)
/// TXWRN - TX Error Warning
/// 0b0..No such occurrence.
/// 0b1..TXERRCNT is greater than or equal to 96.

#define CAN_ESR1_TXWRN(x)                        (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_TXWRN_SHIFT)) & CAN_ESR1_TXWRN_MASK)
#define CAN_ESR1_STFERR_MASK                     (0x400U)
#define CAN_ESR1_STFERR_SHIFT                    (10U)
/// STFERR - Stuffing Error
/// 0b0..No such occurrence.
/// 0b1..A Stuffing Error occurred since last read of this register.

#define CAN_ESR1_STFERR(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_STFERR_SHIFT)) & CAN_ESR1_STFERR_MASK)
#define CAN_ESR1_FRMERR_MASK                     (0x800U)
#define CAN_ESR1_FRMERR_SHIFT                    (11U)
/// FRMERR - Form Error
/// 0b0..No such occurrence.
/// 0b1..A Form Error occurred since last read of this register.

#define CAN_ESR1_FRMERR(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_FRMERR_SHIFT)) & CAN_ESR1_FRMERR_MASK)
#define CAN_ESR1_CRCERR_MASK                     (0x1000U)
#define CAN_ESR1_CRCERR_SHIFT                    (12U)
/// CRCERR - Cyclic Redundancy Check Error
/// 0b0..No such occurrence.
/// 0b1..A CRC error occurred since last read of this register.

